// Напишите программу, которая на вход принимает
// число и выдает, является ли число четным (делится ли оно на два без остатка)

Console.WriteLine("Enter number");
string N = Console.ReadLine();
int A = int.Parse(N);


if (A % 2 == 0)
{
    Console.WriteLine("even number");
}
else
{
    Console.WriteLine("odd number enter the following");
}
